zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/MIMXRT798S_ezhv_COMMON.h
/* CLKCTL2 - Peripheral instance base addresses */
/** Peripheral CLKCTL2 base address */
#define CLKCTL2_BASE                             (0x40065000u)
/** Peripheral CLKCTL2 base pointer */
#define CLKCTL2                                  ((CLKCTL2_Type *)CLKCTL2_BASE)
/** Array initializer of CLKCTL2 peripheral base addresses */
#define CLKCTL2_BASE_ADDRS                       { CLKCTL2_BASE }
/** Array initializer of CLKCTL2 peripheral base pointers */
#define CLKCTL2_BASE_PTRS                        { CLKCTL2 }

/* CLKCTL3 - Peripheral instance base addresses */
/** Peripheral CLKCTL3 base address */
#define CLKCTL3_BASE                             (0x40061000u)
/** Peripheral CLKCTL3 base pointer */
#define CLKCTL3                                  ((CLKCTL3_Type *)CLKCTL3_BASE)
/** Array initializer of CLKCTL3 peripheral base addresses */
#define CLKCTL3_BASE_ADDRS                       { CLKCTL3_BASE }
/** Array initializer of CLKCTL3 peripheral base pointers */
#define CLKCTL3_BASE_PTRS                        { CLKCTL3 }

/* CLKCTL4 - Peripheral instance base addresses */
/** Peripheral CLKCTL4 base address */
#define CLKCTL4_BASE                             (0x400A1000u)
/** Peripheral CLKCTL4 base pointer */
#define CLKCTL4                                  ((CLKCTL4_Type *)CLKCTL4_BASE)
/** Array initializer of CLKCTL4 peripheral base addresses */
#define CLKCTL4_BASE_ADDRS                       { CLKCTL4_BASE }
/** Array initializer of CLKCTL4 peripheral base pointers */
#define CLKCTL4_BASE_PTRS                        { CLKCTL4 }

/* CMP - Peripheral instance base addresses */
/** Peripheral ACMP0 base address */
#define ACMP0_BASE                               (0x4020B000u)
/** Peripheral ACMP0 base pointer */
#define ACMP0                                    ((CMP_Type *)ACMP0_BASE)
/** Array initializer of CMP peripheral base addresses */
#define CMP_BASE_ADDRS                           { ACMP0_BASE }
/** Array initializer of CMP peripheral base pointers */
#define CMP_BASE_PTRS                            { ACMP0 }

/* CRC - Peripheral instance base addresses */
/** Peripheral CRC base address */
#define CRC_BASE                                 (0x40151000u)
/** Peripheral CRC base pointer */
#define CRC                                      ((CRC_Type *)CRC_BASE)
/** Array initializer of CRC peripheral base addresses */
#define CRC_BASE_ADDRS                           { CRC_BASE }
/** Array initializer of CRC peripheral base pointers */
#define CRC_BASE_PTRS                            { CRC }

/* CTIMER - Peripheral instance base addresses */
/** Peripheral CTIMER0 base address */
#define CTIMER0_BASE                             (0x40028000u)
/** Peripheral CTIMER0 base pointer */
#define CTIMER0                                  ((CTIMER_Type *)CTIMER0_BASE)
/** Peripheral CTIMER1 base address */
#define CTIMER1_BASE                             (0x40029000u)
/** Peripheral CTIMER1 base pointer */
#define CTIMER1                                  ((CTIMER_Type *)CTIMER1_BASE)
/** Peripheral CTIMER2 base address */
#define CTIMER2_BASE                             (0x4002A000u)
/** Peripheral CTIMER2 base pointer */
#define CTIMER2                                  ((CTIMER_Type *)CTIMER2_BASE)
/** Peripheral CTIMER3 base address */
#define CTIMER3_BASE                             (0x4002B000u)
/** Peripheral CTIMER3 base pointer */
#define CTIMER3                                  ((CTIMER_Type *)CTIMER3_BASE)
/** Peripheral CTIMER4 base address */
#define CTIMER4_BASE                             (0x4002C000u)
/** Peripheral CTIMER4 base pointer */
#define CTIMER4                                  ((CTIMER_Type *)CTIMER4_BASE)
/** Peripheral CTIMER5 base address */
#define CTIMER5_BASE                             (0x40048000u)
/** Peripheral CTIMER5 base pointer */
#define CTIMER5                                  ((CTIMER_Type *)CTIMER5_BASE)
/** Peripheral CTIMER6 base address */
#define CTIMER6_BASE                             (0x40049000u)
/** Peripheral CTIMER6 base pointer */
#define CTIMER6                                  ((CTIMER_Type *)CTIMER6_BASE)
/** Peripheral CTIMER7 base address */
#define CTIMER7_BASE                             (0x4004A000u)
/** Peripheral CTIMER7 base pointer */
#define CTIMER7                                  ((CTIMER_Type *)CTIMER7_BASE)
/** Array initializer of CTIMER peripheral base addresses */
#define CTIMER_BASE_ADDRS                        { CTIMER0_BASE, CTIMER1_BASE, CTIMER2_BASE, CTIMER3_BASE, CTIMER4_BASE, CTIMER5_BASE, CTIMER6_BASE, CTIMER7_BASE }
/** Array initializer of CTIMER peripheral base pointers */
#define CTIMER_BASE_PTRS                         { CTIMER0, CTIMER1, CTIMER2, CTIMER3, CTIMER4, CTIMER5, CTIMER6, CTIMER7 }

/* DMA - Peripheral instance base addresses */
/** Peripheral DMA0 base address */
#define DMA0_BASE                                (0x40140000u)
/** Peripheral DMA0 base pointer */
#define DMA0                                     ((DMA_Type *)DMA0_BASE)
/** Peripheral DMA1 base address */
#define DMA1_BASE                                (0x40160000u)
/** Peripheral DMA1 base pointer */
#define DMA1                                     ((DMA_Type *)DMA1_BASE)
/** Peripheral DMA2 base address */
#define DMA2_BASE                                (0x40300000u)
/** Peripheral DMA2 base pointer */
#define DMA2                                     ((DMA_Type *)DMA2_BASE)
/** Peripheral DMA3 base address */
#define DMA3_BASE                                (0x40310000u)
/** Peripheral DMA3 base pointer */
#define DMA3                                     ((DMA_Type *)DMA3_BASE)
/** Array initializer of DMA peripheral base addresses */
#define DMA_BASE_ADDRS                           { DMA0_BASE, DMA1_BASE, DMA2_BASE, DMA3_BASE }
/** Array initializer of DMA peripheral base pointers */
#define DMA_BASE_PTRS                            { DMA0, DMA1, DMA2, DMA3 }

/* ELS - Peripheral instance base addresses */
/** Peripheral ELS base address */
#define ELS_BASE                                 (0x40190000u)
/** Peripheral ELS base pointer */
#define ELS                                      ((ELS_Type *)ELS_BASE)
/** Peripheral ELS_ALIAS1 base address */
#define ELS_ALIAS1_BASE                          (0x40191000u)
/** Peripheral ELS_ALIAS1 base pointer */
#define ELS_ALIAS1                               ((ELS_Type *)ELS_ALIAS1_BASE)
/** Peripheral ELS_ALIAS2 base address */
#define ELS_ALIAS2_BASE                          (0x40192000u)
/** Peripheral ELS_ALIAS2 base pointer */
#define ELS_ALIAS2                               ((ELS_Type *)ELS_ALIAS2_BASE)
/** Peripheral ELS_ALIAS3 base address */
#define ELS_ALIAS3_BASE                          (0x40193000u)
/** Peripheral ELS_ALIAS3 base pointer */
#define ELS_ALIAS3                               ((ELS_Type *)ELS_ALIAS3_BASE)
/** Array initializer of ELS peripheral base addresses */
#define ELS_BASE_ADDRS                           { ELS_BASE, ELS_ALIAS1_BASE, ELS_ALIAS2_BASE, ELS_ALIAS3_BASE }
/** Array initializer of ELS peripheral base pointers */
#define ELS_BASE_PTRS                            { ELS, ELS_ALIAS1, ELS_ALIAS2, ELS_ALIAS3 }

/* FLEXIO - Peripheral instance base addresses */
/** Peripheral FLEXIO base address */
#define FLEXIO_BASE                              (0x40416000u)
/** Peripheral FLEXIO base pointer */
#define FLEXIO                                   ((FLEXIO_Type *)FLEXIO_BASE)
/** Array initializer of FLEXIO peripheral base addresses */
#define FLEXIO_BASE_ADDRS                        { FLEXIO_BASE }
/** Array initializer of FLEXIO peripheral base pointers */
#define FLEXIO_BASE_PTRS                         { FLEXIO }

/* FREQME - Peripheral instance base addresses */
/** Peripheral FREQME base address */
#define FREQME_BASE                              (0x40023000u)
/** Peripheral FREQME base pointer */
#define FREQME                                   ((FREQME_Type *)FREQME_BASE)
/** Array initializer of FREQME peripheral base addresses */
#define FREQME_BASE_ADDRS                        { FREQME_BASE }
/** Array initializer of FREQME peripheral base pointers */
#define FREQME_BASE_PTRS                         { FREQME }

