zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/MIMXRT798S_ezhv_COMMON.h
/* MMU - Peripheral instance base addresses */
/** Peripheral MMU0 base address */
#define MMU0_BASE                                (0x40030000u)
/** Peripheral MMU0 base pointer */
#define MMU0                                     ((MMU_Type *)MMU0_BASE)
/** Peripheral MMU1 base address */
#define MMU1_BASE                                (0x40031000u)
/** Peripheral MMU1 base pointer */
#define MMU1                                     ((MMU_Type *)MMU1_BASE)
/** Peripheral MMU2 base address */
#define MMU2_BASE                                (0x400A8000u)
/** Peripheral MMU2 base pointer */
#define MMU2                                     ((MMU_Type *)MMU2_BASE)
/** Array initializer of MMU peripheral base addresses */
#define MMU_BASE_ADDRS                           { MMU0_BASE, MMU1_BASE, MMU2_BASE }
/** Array initializer of MMU peripheral base pointers */
#define MMU_BASE_PTRS                            { MMU0, MMU1, MMU2 }

/* MRT - Peripheral instance base addresses */
/** Peripheral MRT0 base address */
#define MRT0_BASE                                (0x4002D000u)
/** Peripheral MRT0 base pointer */
#define MRT0                                     ((MRT_Type *)MRT0_BASE)
/** Peripheral MRT1 base address */
#define MRT1_BASE                                (0x4004D000u)
/** Peripheral MRT1 base pointer */
#define MRT1                                     ((MRT_Type *)MRT1_BASE)
/** Array initializer of MRT peripheral base addresses */
#define MRT_BASE_ADDRS                           { MRT0_BASE, MRT1_BASE }
/** Array initializer of MRT peripheral base pointers */
#define MRT_BASE_PTRS                            { MRT0, MRT1 }

/* MU - Peripheral instance base addresses */
/** Peripheral MU0_MUA base address */
#define MU0_MUA_BASE                             (0x40200000u)
/** Peripheral MU0_MUA base pointer */
#define MU0_MUA                                  ((MU_Type *)MU0_MUA_BASE)
/** Peripheral MU0_MUB base address */
#define MU0_MUB_BASE                             (0x40201000u)
/** Peripheral MU0_MUB base pointer */
#define MU0_MUB                                  ((MU_Type *)MU0_MUB_BASE)
/** Peripheral MU1_MUA base address */
#define MU1_MUA_BASE                             (0x40202000u)
/** Peripheral MU1_MUA base pointer */
#define MU1_MUA                                  ((MU_Type *)MU1_MUA_BASE)
/** Peripheral MU1_MUB base address */
#define MU1_MUB_BASE                             (0x40203000u)
/** Peripheral MU1_MUB base pointer */
#define MU1_MUB                                  ((MU_Type *)MU1_MUB_BASE)
/** Peripheral MU2_MUA base address */
#define MU2_MUA_BASE                             (0x40204000u)
/** Peripheral MU2_MUA base pointer */
#define MU2_MUA                                  ((MU_Type *)MU2_MUA_BASE)
/** Peripheral MU2_MUB base address */
#define MU2_MUB_BASE                             (0x40205000u)
/** Peripheral MU2_MUB base pointer */
#define MU2_MUB                                  ((MU_Type *)MU2_MUB_BASE)
/** Peripheral MU3_MUA base address */
#define MU3_MUA_BASE                             (0x40319000u)
/** Peripheral MU3_MUA base pointer */
#define MU3_MUA                                  ((MU_Type *)MU3_MUA_BASE)
/** Peripheral MU3_MUB base address */
#define MU3_MUB_BASE                             (0x4031A000u)
/** Peripheral MU3_MUB base pointer */
#define MU3_MUB                                  ((MU_Type *)MU3_MUB_BASE)
/** Array initializer of MU peripheral base addresses */
#define MU_BASE_ADDRS                            { MU0_MUA_BASE, MU0_MUB_BASE, MU1_MUA_BASE, MU1_MUB_BASE, MU2_MUA_BASE, MU2_MUB_BASE, MU3_MUA_BASE, MU3_MUB_BASE }
/** Array initializer of MU peripheral base pointers */
#define MU_BASE_PTRS                             { MU0_MUA, MU0_MUB, MU1_MUA, MU1_MUB, MU2_MUA, MU2_MUB, MU3_MUA, MU3_MUB }

/* NIC - Peripheral instance base addresses */
/** Peripheral NIC_MEDIA1 base address */
#define NIC_MEDIA1_BASE                          (0x404C0000u)
/** Peripheral NIC_MEDIA1 base pointer */
#define NIC_MEDIA1                               ((NIC_Type *)NIC_MEDIA1_BASE)
/** Array initializer of NIC peripheral base addresses */
#define NIC_BASE_ADDRS                           { NIC_MEDIA1_BASE }
/** Array initializer of NIC peripheral base pointers */
#define NIC_BASE_PTRS                            { NIC_MEDIA1 }

/* OCOTP - Peripheral instance base addresses */
/** Peripheral OCOTP base address */
#define OCOTP_BASE                               (0x40018000u)
/** Peripheral OCOTP base pointer */
#define OCOTP                                    ((OCOTP_Type *)OCOTP_BASE)
/** Array initializer of OCOTP peripheral base addresses */
#define OCOTP_BASE_ADDRS                         { OCOTP_BASE }
/** Array initializer of OCOTP peripheral base pointers */
#define OCOTP_BASE_PTRS                          { OCOTP }

/* OSC32KNP - Peripheral instance base addresses */
/** Peripheral OSC32KNP base address */
#define OSC32KNP_BASE                            (0x40063000u)
/** Peripheral OSC32KNP base pointer */
#define OSC32KNP                                 ((OSC32KNP_Type *)OSC32KNP_BASE)
/** Array initializer of OSC32KNP peripheral base addresses */
#define OSC32KNP_BASE_ADDRS                      { OSC32KNP_BASE }
/** Array initializer of OSC32KNP peripheral base pointers */
#define OSC32KNP_BASE_PTRS                       { OSC32KNP }

/* OSCCA - Peripheral instance base addresses */
/** Peripheral OSCCA base address */
#define OSCCA_BASE                               (0x4001A000u)
/** Peripheral OSCCA base pointer */
#define OSCCA                                    ((OSCCA_Type *)OSCCA_BASE)
/** Array initializer of OSCCA peripheral base addresses */
#define OSCCA_BASE_ADDRS                         { OSCCA_BASE }
/** Array initializer of OSCCA peripheral base pointers */
#define OSCCA_BASE_PTRS                          { OSCCA }

/* OSTIMER - Peripheral instance base addresses */
/** Peripheral OSTIMER_CPU0 base address */
#define OSTIMER_CPU0_BASE                        (0x40207000u)
/** Peripheral OSTIMER_CPU0 base pointer */
#define OSTIMER_CPU0                             ((OSTIMER_Type *)OSTIMER_CPU0_BASE)
/** Peripheral OSTIMER_CPU1 base address */
#define OSTIMER_CPU1_BASE                        (0x40209000u)
/** Peripheral OSTIMER_CPU1 base pointer */
#define OSTIMER_CPU1                             ((OSTIMER_Type *)OSTIMER_CPU1_BASE)
/** Peripheral OSTIMER_HIFI1 base address */
#define OSTIMER_HIFI1_BASE                       (0x4020A000u)
/** Peripheral OSTIMER_HIFI1 base pointer */
#define OSTIMER_HIFI1                            ((OSTIMER_Type *)OSTIMER_HIFI1_BASE)
/** Peripheral OSTIMER_HIFI4 base address */
#define OSTIMER_HIFI4_BASE                       (0x40208000u)
/** Peripheral OSTIMER_HIFI4 base pointer */
#define OSTIMER_HIFI4                            ((OSTIMER_Type *)OSTIMER_HIFI4_BASE)
/** Array initializer of OSTIMER peripheral base addresses */
#define OSTIMER_BASE_ADDRS                       { OSTIMER_CPU0_BASE, OSTIMER_CPU1_BASE, OSTIMER_HIFI1_BASE, OSTIMER_HIFI4_BASE }
/** Array initializer of OSTIMER peripheral base pointers */
#define OSTIMER_BASE_PTRS                        { OSTIMER_CPU0, OSTIMER_CPU1, OSTIMER_HIFI1, OSTIMER_HIFI4 }

/* PDM - Peripheral instance base addresses */
/** Peripheral PDM base address */
#define PDM_BASE                                 (0x4020E000u)
/** Peripheral PDM base pointer */
#define PDM                                      ((PDM_Type *)PDM_BASE)
/** Array initializer of PDM peripheral base addresses */
#define PDM_BASE_ADDRS                           { PDM_BASE }
/** Array initializer of PDM peripheral base pointers */
#define PDM_BASE_PTRS                            { PDM }

/* PINT - Peripheral instance base addresses */
/** Peripheral PINT0 base address */
#define PINT0_BASE                               (0x40025000u)
/** Peripheral PINT0 base pointer */
#define PINT0                                    ((PINT_Type *)PINT0_BASE)
/** Peripheral PINT1 base address */
#define PINT1_BASE                               (0x40045000u)
/** Peripheral PINT1 base pointer */
#define PINT1                                    ((PINT_Type *)PINT1_BASE)
/** Array initializer of PINT peripheral base addresses */
#define PINT_BASE_ADDRS                          { PINT0_BASE, PINT1_BASE }
/** Array initializer of PINT peripheral base pointers */
#define PINT_BASE_PTRS                           { PINT0, PINT1 }

