zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/RT/RT700/MIMXRT798S/MIMXRT798S_ezhv_COMMON.h
/* XCACHE - Peripheral instance base addresses */
/** Peripheral XCACHE0 base address */
#define XCACHE0_BASE                             (0x40033000u)
/** Peripheral XCACHE0 base pointer */
#define XCACHE0                                  ((XCACHE_Type *)XCACHE0_BASE)
/** Peripheral XCACHE1 base address */
#define XCACHE1_BASE                             (0x40034000u)
/** Peripheral XCACHE1 base pointer */
#define XCACHE1                                  ((XCACHE_Type *)XCACHE1_BASE)
/** Array initializer of XCACHE peripheral base addresses */
#define XCACHE_BASE_ADDRS                        { XCACHE0_BASE, XCACHE1_BASE }
/** Array initializer of XCACHE peripheral base pointers */
#define XCACHE_BASE_PTRS                         { XCACHE0, XCACHE1 }
/** XCACHE physical memory base address */
 #define XCACHE_PHYMEM_BASES                       { 0x20000000u, 0x00000000u }
/** XCACHE physical memory size */
 #define XCACHE_PHYMEM_SIZES                       { 0x780000u, 0x780000u }
/* Backward compatibility */
#define XCACHE_CSAR_PHYADDR_MASK (XCACHE_CSAR_PHYADDR27_1_MASK | XCACHE_CSAR_PHYADDR31_29_MASK)


/* XSPI - Peripheral instance base addresses */
/** Peripheral XSPI0 base address */
#define XSPI0_BASE                               (0x40184000u)
/** Peripheral XSPI0 base pointer */
#define XSPI0                                    ((XSPI_Type *)XSPI0_BASE)
/** Peripheral XSPI1 base address */
#define XSPI1_BASE                               (0x40185000u)
/** Peripheral XSPI1 base pointer */
#define XSPI1                                    ((XSPI_Type *)XSPI1_BASE)
/** Peripheral XSPI2 base address */
#define XSPI2_BASE                               (0x40411000u)
/** Peripheral XSPI2 base pointer */
#define XSPI2                                    ((XSPI_Type *)XSPI2_BASE)
/** Array initializer of XSPI peripheral base addresses */
#define XSPI_BASE_ADDRS                          { XSPI0_BASE, XSPI1_BASE, XSPI2_BASE }
/** Array initializer of XSPI peripheral base pointers */
#define XSPI_BASE_PTRS                           { XSPI0, XSPI1, XSPI2 }
  /* XSPI AMBA address. */
  #define XSPI0_AMBA_BASE      (0x28000000u)
  #define XSPI1_AMBA_BASE      (0x08000000u)
  #define XSPI2_AMBA_BASE      (0x60000000u)
  #define XSPI_AMBA_BASES      {0x28000000u, 0x08000000u, 0x60000000u}


/* ----------------------------------------------------------------------------
   -- Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Bit_Field_Generic_Macros Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
 * @{
 */

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field ## _SHIFT)) & (field ## _MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field ## _MASK)) >> (field ## _SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

/**  Used for get the base address of ROM API */
#define FSL_ROM_API_BASE_ADDR 0x1302F000U

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* MIMXRT798S_EZHV_COMMON_H_ */

